[
  {
    "id": 1,
    "title": "Tasty Tales – A Dynamic Recipe-Sharing Platform",
    "description": "Tasty Tales is a full-stack web application where users can explore, contribute, and manage delicious food recipes. It includes an admin dashboard and a parcel management system to handle food and ingredient deliveries.",
    "image": "/tastytales.png",
    "tags": ["React", "Tailwind", "Node.js", "Express.js", "MongoDB"],
    "github": "https://github.com/alvinmonir411/TastyTales-Client",
    "live": "https://tastytales1.netlify.app/",
    "technology_stack": [
      "React",
      "Tailwind CSS",
      "Node.js",
      "Express.js",
      "MongoDB"
    ],
    "project_overview": "Tasty Tales is a full-featured MERN stack recipe-sharing platform with functionality for browsing, adding, and managing recipes. It includes a role-based admin dashboard and an integrated parcel delivery system for food/ingredient logistics.",
    "challenges_and_solutions": "A key challenge was combining content management with delivery tracking. This was solved by designing an intuitive admin panel that allows easy control over recipe approvals and parcel status, resulting in efficient backend operations and a seamless user experience.",
    "future_plans": "Future updates include launching a cross-platform mobile app, using AI for personalized recipe suggestions, and adding real-time GPS-based delivery tracking."
  },
  {
    "id": 2,
    "title": "Task Management Application",
    "description": "A full-stack Task Management I amb application built with React, Express.js, and MongoDB. Users can create, update, delete, and manage tasks with authentication support. with JWT verification",
    "image": "/task-marketplace.png",
    "tags": ["React.js", "MongoDB", "Node.js", "Express.js"],
    "github": "https://github.com/alvinmonir411/Task-Marketplace-client",
    "live": "https://freelancehub1.netlify.app/",
    "technology_stack": ["React.js", "MongoDB", "Node.js", "Express.js"],
    "project_overview": "Task Management Application is a full-stack I amb application built for managing and organizing tasks. It allows users to create, update, delete, and track their tasks with features like user authentication and JWT-based security.",
    "challenges_and_solutions": "One challenge was to implement a secure authentication system. This was solved by using JWT (JSON I amb Tokens) to handle user authentication, ensuring the safety of the user's task data.",
    "future_plans": "Future improvements will include adding a notification system for reminders, integrating third-party authentication (e.g., Google and GitHub), and adding a mobile-responsive version."
  },
  {
    "id": 3,
    "title": "📘 ShikkhaZone – Knowledge Sharing Platform",
    "description": "A full-stack MERN-based knowledge-sharing platform where students and learners can publish articles, gain insights, and engage in meaningful discussions. Users can post, like, and comment on articles to connect with others.",
    "image": "/sikhazone.png",
    "tags": ["React", "TailwindCSS", "MongoDB", "Node.js"],
    "github": "https://github.com/alvinmonir411/Sikkha-Zone-Client?tab=readme-ov-file",
    "live": "https://sikka-zone.netlify.app/",
    "technology_stack": ["React", "TailwindCSS", "MongoDB", "Node.js"],
    "project_overview": "ShikkhaZone is an educational knowledge-sharing platform built for students, learners, and professionals to publish and explore valuable content. It supports article creation, liking, and commenting to encourage collaborative learning.",
    "challenges_and_solutions": "One major challenge was maintaining a smooth user experience for likes and discussions in real-time. This was solved using WebSockets and MongoDB’s change streams, allowing efficient updates and real-time interactions.",
    "future_plans": "Future improvements include integrating video content sharing, enabling real-time chat features, and introducing contributor profiles with achievements and badges to reward community engagement."
  }
]
