[
  {
    "id": 1,
    "title": "Tasty Tales is a dynamic recipe-sharing platform",
    "description": "where users can explore, contribute, and manage delicious food recipes. The platform features a user-friendly admin dashboard and a parcel management system for food or ingredient deliveries.",
    "image": "/tastytales.png",
    "tags": ["React", "Tailwind", "Node.js", "Express.js", "MongoDB"],
    "github": "https://github.com/alvinmonir411/TastyTales-Client",
    "live": "https://tastytales1.netlify.app/",
    "technology_stack": [
      "React",
      "TailwindCSS",
      "Node.js",
      "Express.js",
      "MongoDB"
    ],
    "project_overview": "Tasty Tales is a dynamic recipe-sharing platform where users can explore, contribute, and manage delicious food recipes. The platform features a user-friendly admin dashboard and a parcel management system for food or ingredient deliveries.",
    "challenges_and_solutions": "A major challenge was to create a seamless experience for managing food deliveries and recipe contributions. The solution was building a comprehensive admin dashboard that allows easy tracking of deliveries and user contributions, ensuring smooth workflow.",
    "future_plans": "I am plan to introduce a mobile app for both iOS and Android, implement AI for personalized recipe suggestions, and integrate real-time delivery tracking."
  },
  {
    "id": 2,
    "title": "Task Management Application",
    "description": "A full-stack Task Management I amb application built with React, Express.js, and MongoDB. Users can create, update, delete, and manage tasks with authentication support. with JWT verification",
    "image": "/task-marketplace.png",
    "tags": ["React.js", "MongoDB", "Node.js", "Express.js"],
    "github": "https://github.com/alvinmonir411/Task-Marketplace-client",
    "live": "https://freelancehub1.netlify.app/",
    "technology_stack": ["React.js", "MongoDB", "Node.js", "Express.js"],
    "project_overview": "Task Management Application is a full-stack I amb application built for managing and organizing tasks. It allows users to create, update, delete, and track their tasks with features like user authentication and JWT-based security.",
    "challenges_and_solutions": "One challenge was to implement a secure authentication system. This was solved by using JWT (JSON I amb Tokens) to handle user authentication, ensuring the safety of the user's task data.",
    "future_plans": "Future improvements will include adding a notification system for reminders, integrating third-party authentication (e.g., Google and GitHub), and adding a mobile-responsive version."
  },
  {
    "id": 3,
    "title": "📘 ShikkhaZone – Knowledge Sharing Platform",
    "description": "A full-stack MERN-based knowledge-sharing platform where students and learners can share articles, gain insights, and engage in meaningful discussions. Users can post, like articles, and interact with others.",
    "image": "/sikhazone.png",
    "tags": ["React", "TailwindCSS", "MongoDB", "Node.js"],
    "github": "https://github.com/alvinmonir411/Sikkha-Zone-Client?tab=readme-ov-file",
    "live": "https://sikka-zone.netlify.app/",
    "technology_stack": ["React", "TailwindCSS", "MongoDB", "Node.js"],
    "project_overview": "ShikkhaZone is a knowledge-sharing platform designed to bring students, learners, and professionals together to share articles, insights, and experiences. The platform allows users to post and like articles and interact through comments and discussions.",
    "challenges_and_solutions": "A key challenge was ensuring smooth interaction and real-time updates for discussions and likes. I am implemented I ambSockets and used MongoDB’s change streams for efficient updates and notifications in real-time.",
    "future_plans": "I am plan to expand the platform by adding video content sharing, real-time chat functionality, and creating user profiles with achievements and badges for active contributors."
  }
]
